In [7]:
import pandas as pd

df1 = pd.read_csv("stock_data.csv")
df1.set_index("tickers", inplace=True)
df1

                   eps  revenue price         people
tickers
GOOGL            27.82       87   845     larry page
WMT               4.61      484    65           n.a.
MSFT                -1       85    64     bill gates
RIL      not available       50  1023  mukesh ambani
TATA               5.6       -1  n.a.     ratan tata

In [2]:
df = pd.read_csv("stock_data.csv", skiprows=1)
df

### row begins from zero whereas header begins from 1
### row number 1 is removed

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [3]:
df = pd.read_csv("stock_data.csv", header=1) 
df

### header works like index, so header =1 means,
### start the table from index 1, by skipping 0

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [4]:
df = pd.read_csv("stock_data.csv",  nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [5]:
.
.
.
.
##### THE BELOW FOLLOWING TRICKS ARE USED TO CLEAN DATA
## AND ARE HELPFUL IN DATA MUNGING AND DATA wrangling
.  
.
.
.

SyntaxError: invalid syntax (807585114.py, line 1)

In [ ]:
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])
df

### na_values is a key function to clean data

In [ ]:
""" revenue has -1 nd, revenue can't be -ve,
but eps also has a -ve value and it is allowed
so now we need to remove -1 from revenue specifically,
we can do that by putting the na_values condition
specifically for each colomn 

na_values is dictionary  """

df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available','n.a.'],
        'revenue': ['not available','n.a.',-1],
        'people': ['not available','n.a.']
    })
df

In [ ]:
.
.
.
.
### writing csv file
.
.
.
.

In [ ]:
df.to_csv("new_sd.csv")
### now a new table is created, if you don't want the indexes, then

In [ ]:
df.to_csv("new_sd.csv", index=False)

In [11]:
### to write only few coloumns to the new file,
### we can select column specifically

df1.columns ## this statement is to get column names so that we can see and then pass them
df1.to_csv("new_sd.csv", columns=[ 'eps', 'revenue']) ## tickers will automatically come as it is the index of the parent table

new_df = pd.read_csv("new_sd.csv")
#new_df.set_index("tickers",inplace=True)
new_df

  tickers            eps  revenue
0   GOOGL          27.82       87
1     WMT           4.61      484
2    MSFT             -1       85
3    RIL   not available       50
4    TATA            5.6       -1

In [12]:
new_df.set_index("tickers",inplace=True)
new_df

                   eps  revenue
tickers
GOOGL            27.82       87
WMT               4.61      484
MSFT                -1       85
RIL      not available       50
TATA               5.6       -1

In [ ]:
import pandas as pd

def convert_people_func(cell):
    if cell=='n.a.':
        return "default name"
    return cell
df = pd.read_csv("stock_data.csv",converters={
    'people': convert_people_func
})
df

### here converter function is used to read all the elements
### of a specified row, and then call user defined function for
### each of the cells

In [ ]:
import pandas as pd

df=pd.read_excel("stock_data.xlsx","Sheet2")
df

In [ ]:
df.to_excel("new.xlsx",sheet_name="stocks",startrow=1,startcol=2)
### new xlsx file is created

In [ ]:
a=pd.read_excel("new.xlsx","stocks")
a
###new xlsx file is viewed

In [ ]:
""" we can use other functions for read_csv such as 
skipfooter=0 , skip_blank_line=True, skiprow= .....nd so on """